yes_were_open/app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "socialMedia", "imageurl", "sub_category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "hi"], ["socialMedia", "hi"], ["imageurl", "hi"], ["sub_category", "hi"], ["created_at", "2020-05-20 16:41:08.859516"], ["updated_at", "2020-05-20 16:41:08.859516"]]
---
  def create
    @restaurant = Restaurant.new(restaurant_params)

    if @restaurant.save

UPDATE "restaurants" SET "name" = $1, "socialMedia" = $2, "imageurl" = $3, "sub_category" = $4, "updated_at" = $5 WHERE "restaurants"."id" = $6  [["name", "newer"], ["socialMedia", "newer"], ["imageurl", "newer"], ["sub_category", "newer"], ["updated_at", "2020-05-20 17:47:51.223528"], ["id", 6]]
---
  def update
    if @restaurant.update(restaurant_params)